app/views/pages/_list_pages.html.erb

SELECT "pages".* FROM "pages" WHERE ("pages".user_id = 1)
---
      <div class="row-action">
        <% unless user_signed_in? && current_user.pages.length > 0 %>