app/controllers/home_controller.rb

      :order => "id desc",
      :limit => 40
    )
    @feed = @feed.group_by {|s| s.user }
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1