app/controllers/organizations_controller.rb

  def edit
    @organization = current_user.organizations.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE ("organizations"."id" = 1) LIMIT 1