app/controllers/pages_controller.rb

  def my_pages
    @pages = current_user.pages.all
---
SELECT "pages".* FROM "pages" WHERE ("pages".user_id = 1)

  def new
    @page = Page.new

    if params[:org_id]
      begin
        @organization = Organization.find params[:org_id]
---
SELECT "organizations".* FROM "organizations"