app/controllers/projects_controller.rb

  def by_organization
    org = Organization.find(params[:id])
    if org
      @projects = org.projects.all
---
SELECT "organizations".* FROM "organizations" WHERE ("organizations"."id" = 1) LIMIT 1
SELECT "projects".* FROM "projects" WHERE ("projects".organization_id = 1)

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1

  def new
    @project = Project.new
    begin
      @organization = Organization.find(params[:organization_id])
---
SELECT "organizations".* FROM "organizations" WHERE ("organizations"."id" = 1) LIMIT 1

  def edit
    @project = Project.find(params[:id])
    if @project.organization.user != current_user
      flash[:notice] = "Sadece yöneticisi olduğunuz kurumların projelerini düzenleyebilirsiniz."
      redirect_to @project
    end
    @predefined_payments = @project.predefined_payments.where("NOT deleted")
---
SELECT "projects".* FROM "projects" WHERE ("projects".organization_id = 1) AND ("projects"."id" = 1) LIMIT 1
SELECT "organizations".* FROM "organizations" WHERE ("organizations"."id" = 1) LIMIT 1

  def create
    begin
      @organization = current_user.organizations.find(params[:organization_id])
      @project = @organization.projects.build(params[:project])
    rescue
      #we know it cannot be created w/o organization but just to let things go
      #we create it
      @project = Project.new(params[:project])
    end
    @project.accepts_random_payment = true
    @predefined_payments = Array.new
    predefineds = params[:predefined] || []
    predefineds.each do |pp_data|
      #set disabled first
      pp_data[:disabled] = "on" == pp_data[:disabled]
      ppRecord = nil
      ppRecord = @project.predefined_payments.build(pp_data)
      @predefined_payments += [ppRecord]
    end
    begin
      Project.transaction do
        @predefined_payments.each do |ppRecord|
          ppRecord.save!
---
SELECT "organizations".* FROM "organizations" WHERE ("organizations"."id" = 1) LIMIT 1
INSERT INTO "projects" ("created_at", "description", "end_time", "name", "organization_id", "start_time", "updated_at") VALUES ('2010-12-20 03:27:07.856649', 'hadi eller havaya', '2013-12-20 03:26:00.000000', 'Yigit''e para topluyoruz', 1, '2010-12-20 03:26:00.000000', '2010-12-20 03:27:07.856649')

  def update
    @project = Project.find(params[:id])
    if @project.organization.user != current_user
      flash[:notice] = "Sadece yöneticisi olduğunuz kurumların projelerini düzenleyebilirsiniz."
      redirect_to @project
    end
    @project.accepts_random_payment = true

    @predefined_payments = Array.new
    predefineds = params[:predefined] || []
    predefineds.each do |pp_data|
      #set disabled first
      pp_data[:disabled] = "on" == pp_data[:disabled]
      ppRecord = nil
      if pp_data[:id] && pp_data[:id].blank? == false #existing record
        ppRecord = @project.predefined_payments.find pp_data[:id]
        ppRecord.update_attributes pp_data
---
SELECT "projects".* FROM "projects" WHERE ("projects".organization_id = 1) AND ("projects"."id" = 1) LIMIT 1
SELECT "organizations".* FROM "organizations" WHERE ("organizations"."id" = 1) LIMIT 1
UPDATE "projects" SET "description" = 'hadi eller cebe', "updated_at" = '2010-12-20 03:27:18.613965' WHERE ("projects"."id" = 1)